;;;-*- Mode: Lisp; Package: TRANSDUCER -*-

(in-package :fst)

(defparameter *croot-table* (dat:make-string-tree))

(do-query ((root croot)
	   [select [root] [c-root] :from [morph verb-features]])
  (pushnew root (dat:string-tree-get *croot-table* croot) :test #'equal))

(defun char-diff (r1 r2)
  (u:collecting
    (loop with i1 = 0 and i2 = 0
       while (or (< i1 (length r1))
		 (< i2 (length r2)))
       do ;; (print (list i1 i2))
       (cond ((= i1 (length r1))
	      ;;(u:collect (cons nil (char r2 i2)))
	      (u:collect (format nil "-/~c" (char r2 i2)))
	      (incf i2))
	     ((= i2 (length r2))
	      ;;(u:collect (cons (char r1 i1) nil))
	      (u:collect (format nil "~c/-" (char r1 i1)))
	      (incf i1))
	     ((char= (char r1 i1) (char r2 i2))
	      (incf i1)
	      (incf i2))
	     ((and (find (char r1 i1) "ეი")
		   (find (char r2 i2) "ეი"))
	      (u:collect (format nil "~c/~c" (char r1 i1) (char r2 i2)))
	      (incf i1)
	      (incf i2))
	     ((find (char r1 i1) "ეავ")
	      (u:collect (format nil "~c/-" (char r1 i1)))
	      (incf i1))
	     ((find (char r2 i2) "ეავ")
	      (u:collect (format nil "-/~c" (char r2 i2)))
	      (incf i2))
	     (t
	      (u:collect (format nil "~c/~c" (char r1 i1) (char r2 i2)))
	      (incf i1)
	      (incf i2))))))

(dat:do-string-tree (c-root roots *croot-table*)
  (setf roots (sort roots #'< :key #'length))
  (when (and (cdr roots)
	     (not (cddr roots)))
   ;; (print c-root)
   ;; (print roots)
    (let ((diff (char-diff (car roots) (cadr roots))))
      (when T ;;(find diff '(("-/ა") ("-/ე")) :test #'equal) 
	(format t "~&~a: ~{~a~^ ~} ~s~%" c-root roots (char-diff (car roots) (cadr roots)))))))

(dat:do-string-tree (c-root roots *croot-table*)
  (setf roots (sort roots #'< :key #'length))
  (when (and (cdr roots)
	     (find-if (lambda (r)
			(and (> (length r) 2)
			     (find (char r (1- (length r))) "ლრნ")
			     (find (char r (- (length r) 2)) "აე")))
		      roots))
    (format t "~&~a: ~{~a~^ ~} ~s~%" c-root roots (char-diff (car roots) (cadr roots)))))


(do-query ((c-root)
	   [select [c-root] :from [morph verb-features]
		   :flatp t :distinct t
		   :where [like [c-root] "%ხ%"]
		   :order-by '([c-root])])
  (print c-root))


(defparameter *q-roots* ())
(defparameter *x-roots* ())

(with-file-lines (line "~/lisp/projects/georgian-morph/wordlists/oge-deu-words1.txt")
  (unless (char= (char line 0) #\<)
    (dolist (x-root *x-root-list*)
      (when (search x-root line :end1 (position (lambda (c) (find c "1234")) x-root))
	(pushnew x-root *x-roots*)))
    (dolist (q-root *q-root-list*)
      (when (search q-root line :end1 (position (lambda (c) (find c "1234")) q-root))
	(pushnew (substitute #\ხ #\ჴ q-root) *q-roots*)))
    (print line)))

(dolist (x-root *x-root-list*)
  (cond ((and (find x-root *x-roots* :test #'equal)
	      (find x-root *q-roots* :test #'equal))
	 (format t "\"~a\" ;; ~a ;; ხ,ჴ~%" x-root (substitute #\ჴ #\ხ x-root)))
	((find x-root *x-roots* :test #'equal)
	 (format t ";; \"~a\" ;; ხ~%" x-root))
	((find x-root *q-roots* :test #'equal)
	 (format t "\"~a\" ;; ~a ;; ჴ~%" x-root (substitute #\ჴ #\ხ x-root)))
	(t
	 (format t ";; \"~a\" ;; -~%" x-root))))

(defparameter *x-root-list*
  '(;; "აბეჩხრ" ;; -
    ;; "ამბოხ" ;; ხ
    ;; "ამხანაგ" ;; -
    ;; "ანჩხლ" ;; -
    ;; "არტახ" ;; ხ
    ;; "არხეინ" ;; -
    ;; "ახალგაზრდავ" ;; -
    ;; "ახლ1" ;; -
    ;; "ახლ2" ;; -
    ;; "ახლოვ" ;; -
    ;; "ბალახ" ;; ხ
    ;; "ბალახტარ" ;; -
    ;; "ბოხ" ;; ხ
    ;; "ბრახუნ" ;; -
    ;; "ბრუხუნ" ;; -
    ;; "ბუხ" ;; -
    ;; "ბუხბუხ" ;; -
    ;; "ბუხუნ" ;; -
    ;; "გლახავ" ;; -
    ;; "გლახაკ" ;; ხ
    ;; "გოხინ" ;; -
    ;; "გრეხ" ;; ხ
    ;; "გრუხუნ" ;; -
    "გულისხმ"  ;; გულისჴმ ;; ხ,ჴ
    ;; "გულუხვ" ;; -
    ;; "გულფიცხ" ;; ხ
    ;; "დიასახლის" ;; -
    ;; "დრუხუნ" ;; -
    ;; "ენამახვილ" ;; -
    ;; "ვაგლახ" ;; ხ
    ;; "ვაივაგლახ" ;; -
    ;; "ვარსკვლავთმრიცხველ" ;; -
    ;; "ვარცხნ" ;; ხ
    ;; "ვასხ" ;; ხ
    ;; "ვახვახ" ;; -
    ;; "ვახშმ" ;; ხ
    ;; "ვერცხლ" ;; ხ
    ;; "ზარხოშ" ;; -
    ;; "ზაფხულ" ;; ხ
    ;; "ზახილ" ;; ხ
    ;; "ზედამხედველ" ;; ხ
    ;; "ზრახ" ;; ხ
    ;; "ზუთხ" ;; -
    "თავხედ"   ;; თავჴედ ;; ჴ
    ;; "თავხელ" ;; -
    ;; "თათხ1" ;; -
    ;; "თათხ2" ;; -
    ;; "თალხ" ;; -
    ;; "თანხმ" ;; -
    ;; "თარხნ" ;; -
    ;; "თახთახ" ;; -
    ;; "თახსირ" ;; -
    ;; "თითხნ" ;; -
    ;; "თოხარიკ" ;; -
    "თოხნ"     ;; თოჴნ ;; ჴ
    ;; "თუთხნ" ;; -
    ;; "თუხთუხ" ;; -
    ;; "თხაპ" ;; -
    ;; "თხაპნ" ;; -
    ;; "თხევ" ;; ხ
    ;; "თხევად" ;; -
    ;; "თხელ"     ;; თჴელ ;; ხ,ჴ
    ;; "თხვრ" ;; -
    ;; "თხზ" ;; ხ
    ;; "თხიჭ" ;; -
    ;; "თხლაშუნ" ;; -
    ;; "თხლეშ" ;; ხ
    ;; "თხოვნ" ;; -
    ;; "თხრ1" ;; -
    ;; "თხუნ" ;; ხ
    ;; "თხუპნ" ;; -
    ;; "კანანახ" ;; ხ
    ;; "კარნახ" ;; -
    ;; "კარწახ" ;; -
    ;; "კვარახჭინ" ;; -
    ;; "კვერცხ" ;; -
    ;; "კვეხნ" ;; -
    ;; "კითხულ" ;; ხ
    ;; "კირცხლ" ;; -
    ;; "კიცხ" ;; ხ
    ;; "კოხ" ;; ხ
    ;; "კოხტავ" ;; -
    ;; "კრეხ1" ;; -
    ;; "კრეხ2" ;; -
    ;; "კრიახ" ;; -
    ;; "კრუნჩხ" ;; -
    ;; "კრუხ" ;; -
    ;; "კრუხუნ" ;; -
    ;; "კუთხ" ;; ხ
    ;; "კურთხევ" ;; ხ
    ;; "კურცხლ1" ;; -
    ;; "კურცხლ2" ;; -
    ;; "კუფხვლ" ;; -
    ;; "კუხ" ;; ხ
    ;; "ლართხ" ;; -
    ;; "ლახ" ;; ხ
    ;; "ლახვრ" ;; -
    ;; "ლახლახ" ;; -
    ;; "ლუფხ" ;; -
    ;; "ლხ"       ;; ლჴ ;; ხ,ჴ
    ;; "ლხინ" ;; ხ
    "მათრახ"   ;; მათრაჴ ;; ჴ
    ;; "მათხოვრ" ;; -
    ;; "მალხაზ" ;; -
    ;; "მამასახლის" ;; ხ
    ;; "მარტოხელ" ;; -
    ;; "მარცხ" ;; ხ
    ;; "მარხ"     ;; მარჴ ;; ხ,ჴ
    ;; "მარხვ" ;; ხ
    ;; "მარხულ" ;; ხ
    ;; "მასხარავ" ;; -
    ;; "მახვ" ;; -
    ;; "მახვილ" ;; -
    ;; "მახვილსიტყვა" ;; -
    ;; "მახინჯ" ;; -
    ;; "მახსოვრ" ;; -
    ;; "მევახშე" ;; ხ
    ;; "მემარცხენ" ;; -
    ;; "მეოჯახე" ;; -
    ;; "მეჩხერ" ;; -
    ;; "მეცხვარე" ;; -
    ;; "მეხ"      ;; მეჴ ;; ხ,ჴ
    ;; "მეხრევ" ;; -
    ;; "მზახლ" ;; -
    ;; "მთხვევ1" ;; -
    ;; "მთხვევ2" ;; -
    ;; "მკითხავ" ;; -
    ;; "მკრახ" ;; -
    ;; "მკრეხელ" ;; -
    ;; "მორცხვ" ;; -
    ;; "მოსახლე" ;; ხ
    ;; "მრეცხა" ;; -
    ;; "მრისხან" ;; ხ
    ;; "მსახიობ" ;; ხ
    ;; "მსახურ" ;; ხ
    ;; "მსხვერპლ" ;; -
    ;; "მსხვილ" ;; -
    ;; "მსხვრევ" ;; -
    ;; "მსხმილ" ;; -
    ;; "მსხმოიარ" ;; -
    ;; "მუქთახორ" ;; -
    ;; "მუხანათ" ;; -
    ;; "მუხთლ" ;; -
    "მუხლ"     ;; მუჴლ ;; ჴ
    "მუხლისთავ" ;; მუჴლისთავ ;; ჴ
    ;; "მუხრუჭ" ;; -
    ;; "მუხტ" ;; ხ
    ;; "მქუხარ" ;; -
    ;; "მცხეთ" ;; -
    ;; "მწუთხ" ;; -
    ;; "მწუხარ" ;; ხ
    ;; "მხ"       ;; მჴ ;; ხ,ჴ
    ;; "მხდალ" ;; -
    "მხედართმთავრ" ;; მჴედართმთავრ ;; ჴ
    "მხედრ"	   ;; მჴედრ ;; ჴ
    ;; "მხელ" ;; -
    "მხეც" ;; მჴეც ;; ჴ
    ;; "მხიარულ" ;; ხ
    ;; "მხილ2" ;; -
    ;; "მხნევ" ;; -
    ;; "მხოლოვ" ;; ხ
    ;; "მხრ"  ;; მჴრ ;; ხ,ჴ
    ;; "ნათხოვრ" ;; -
    ;; "ნაკვერცხლ" ;; -
    ;; "ნართხ" ;; -
    ;; "ნარცხ" ;; ხ
    ;; "ნახევრ" ;; ხ
    ;; "ნახულ" ;; -
    "ნახშირ" ;; ნაჴშირ ;; ჴ
    ;; "ნახჭ" ;; ხ
    ;; "ნეხვ" ;; -
    ;; "ნთხევ" ;; ხ
    ;; "ნიხრ" ;; -
    ;; "ნუსხ1" ;; -
    ;; "ოთხ" ;; ხ
    ;; "ოთხმაგ" ;; -
    ;; "ოხ"   ;; ოჴ ;; ხ,ჴ
    ;; "ოხრ1" ;; -
    ;; "ოხრ2" ;; -
    ;; "ოხუნჯ" ;; -
    ;; "ოჯახ" ;; -
    ;; "ოჯახიან" ;; -
    ;; "პარტახ" ;; -
    ;; "პასუხ" ;; ხ
    ;; "პოხ" ;; ხ
    ;; "პოხიერ" ;; ხ
    ;; "პრეხ" ;; -
    ;; "რაცხ" ;; ხ
    ;; "რახრახ" ;; -
    ;; "რახუნ" ;; -
    ;; "რეცხ" ;; ხ
    ;; "რეხვ" ;; ხ
    ;; "რთხ"  ;; რთჴ ;; ხ,ჴ
    ;; "რისხ" ;; რისჴ ;; ხ,ჴ
    ;; "რიცხ" ;; ხ
    ;; "როხროხ" ;; -
    ;; "რუშხ" ;; -
    ;; "რუხრუხ" ;; -
    ;; "რცხვენ" ;; -
    ;; "რხევ" ;; ხ
    ;; "სამხედროვ" ;; -
    ;; "სამხრ" ;; სამჴრ ;; ხ,ჴ
    ;; "სახ"   ;; საჴ ;; ხ,ჴ
    ;; "სახელ" ;; საჴელ ;; ხ,ჴ
    ;; "სახიერ" ;; ხ
    ;; "სახიჩრ" ;; -
    ;; "სახლ" ;; ხ
    ;; "სახლკარ" ;; -
    ;; "სახლკარიან" ;; -
    ;; "სახრ1" ;; -
    ;; "სახრ2" ;; -
    ;; "სახსოვრ" ;; -
    ;; "სახტ" ;; -
    ;; "სესხულ" ;; -
    ;; "სირცხვილ" ;; -
    ;; "სისხლ" ;; ხ
    ;; "სისხლიან" ;; ხ
    ;; "სისხლხორც" ;; -
    ;; "სიტყვამახვილ" ;; -
    ;; "სიცხ" ;; ხ
    ;; "სურათხატ" ;; -
    ;; "სუსხ" ;; -
    ;; "სხ1" ;; -
    ;; "სხ2" ;; -
    ;; "სხაპუნ" ;; -
    ;; "სხდომ" ;; ხ
    ;; "სხეპ" ;; ხ
    ;; "სხვა" ;; ხ
    ;; "სხვაგვარ" ;; -
    ;; "სხვანაირ" ;; -
    ;; "სხვაფერ" ;; -
    ;; "სხვის" ;; -
    ;; "სხივ" ;; ხ
    ;; "სხივოსნ" ;; -
    ;; "სხლ" ;; ხ
    ;; "სხლეტ" ;; ხ
    ;; "სხურ" ;; ხ
    ;; "ტალახ" ;; -
    ;; "ტალახიან" ;; -
    ;; "ტეხ" ;; ხ
    ;; "ტიხვრ" ;; -
    ;; "ტიხტიხ" ;; -
    ;; "ტრაბახ" ;; -
    ;; "ტრუხუნ" ;; -
    ;; "უკმეხ" ;; -
    ;; "უმძრახ" ;; -
    ;; "უცხო" ;; ხ
    ;; "უხერხულ" ;; -
    ;; "უხეშ" ;; -
    ;; "უხვ" ;; ხ
    ;; "ფართხალ" ;; -
    ;; "ფარჩხ" ;; -
    ;; "ფარცხ" ;; -
    ;; "ფაფხურ" ;; -
    ;; "ფახ1" ;; -
    ;; "ფახ2" ;; -
    ;; "ფახაფუხ" ;; -
    ;; "ფახურ" ;; -
    ;; "ფერცხ" ;; ხ
    "ფერხ" ;; ფერჴ ;; ჴ
    ;; "ფეშხოვ" ;; -
    ;; "ფეხვ" ;; -
    ;; "ფეხმარდ" ;; -
    ;; "ფეხმძიმ" ;; -
    ;; "ფითხნ" ;; -
    ;; "ფიჩხ" ;; ხ
    ;; "ფიცხ" ;; ხ
    ;; "ფოლხვ" ;; -
    ;; "ფორთხ" ;; -
    ;; "ფორხ" ;; -
    ;; "ფორხილ" ;; -
    ;; "ფოფხ" ;; ხ
    ;; "ფოცხ" ;; -
    ;; "ფრთხ" ;; ხ
    ;; "ფრთხვინ" ;; -
    ;; "ფრთხიალ" ;; -
    ;; "ფრთხილ" ;; ხ
    ;; "ფრჩხილ" ;; ხ
    ;; "ფურთხ" ;; -
    ;; "ფუცხუნ" ;; -
    ;; "ფუხფუხ" ;; -
    ;; "ფშხვენ" ;; -
    ;; "ფხავ" ;; ხ
    ;; "ფხაკუნ" ;; -
    ;; "ფხაკურ" ;; -
    ;; "ფხან" ;; ხ
    ;; "ფხატ" ;; -
    ;; "ფხაჭნ" ;; -
    ;; "ფხაჭუნ" ;; -
    ;; "ფხეკ" ;; ხ
    ;; "ფხვიერ" ;; -
    ;; "ფხვნ" ;; -
    ;; "ფხვრ" ;; -
    ;; "ფხიან" ;; -
    ;; "ფხიზლ" ;; -
    ;; "ფხორ" ;; -
    ;; "ფხოტ" ;; -
    ;; "ფხოჭნ" ;; -
    ;; "ფხრეწ" ;; -
    ;; "ფხუილ" ;; -
    ;; "ფხუკიან" ;; -
    ;; "ფხუკუნ" ;; -
    ;; "ფხუწ" ;; -
    ;; "ქურუხ" ;; -
    ;; "ქუხ" ;; ხ
    ;; "ყაზახ" ;; -
    ;; "შაშხ" ;; -
    ;; "შიშხინ" ;; -
    ;; "შუშხ" ;; -
    ;; "შუშხუნ" ;; -
    ;; "შხამ" ;; -
    ;; "შხაპუნ" ;; -
    ;; "შხეპ" ;; -
    ;; "შხეფ" ;; -
    ;; "შხივილ" ;; -
    ;; "შხლართ" ;; -
    ;; "შხრიალ" ;; -
    ;; "შხუილ" ;; -
    ;; "ჩარდახ" ;; -
    ;; "ჩარხ" ;; -
    ;; "ჩაჩხ" ;; ხ
    ;; "ჩაჩხან" ;; -
    ;; "ჩახჩახ" ;; -
    ;; "ჩეხ" ;; -
    ;; "ჩინჩხვრ" ;; -
    ;; "ჩინჩხილ" ;; -
    ;; "ჩიჩხინ" ;; -
    ;; "ჩიხ" ;; -
    ;; "ჩიხირთმავ" ;; -
    ;; "ჩიხრიხ" ;; -
    ;; "ჩმახ" ;; -
    ;; "ჩოჩხ" ;; -
    ;; "ჩუჩხურ" ;; -
    ;; "ჩუხჩუხ" ;; -
    ;; "ჩხაბ" ;; -
    ;; "ჩხავილ" ;; -
    ;; "ჩხაკუნ" ;; -
    ;; "ჩხაპნ" ;; -
    ;; "ჩხარუნ" ;; -
    ;; "ჩხვლეტ" ;; -
    ;; "ჩხივილ" ;; ხ
    ;; "ჩხიკვინ" ;; -
    ;; "ჩხიკინ" ;; -
    ;; "ჩხიკნ" ;; -
    ;; "ჩხირ" ;; ხ
    ;; "ჩხირკედელავ" ;; -
    ;; "ჩხლართ" ;; -
    ;; "ჩხორ" ;; -
    ;; "ჩხრეკ" ;; ხ
    ;; "ჩხრიალ" ;; -
    ;; "ჩხუბ" ;; -
    ;; "ჩხუტ" ;; -
    ;; "ცაცხან" ;; -
    ;; "ცახ" ;; ხ
    ;; "ცახცახ" ;; -
    ;; "ცეცხვლ" ;; -
    ;; "ცეხვ" ;; -
    ;; "ცოცხ" ;; ხ
    ;; "ცოცხლ" ;; ხ
    ;; "ცოხნ" ;; ხ
    ;; "ცხ1" ;; -
    ;; "ცხ2" ;; -
    ;; "ცხ3" ;; -
    ;; "ცხად" ;; ხ
    ;; "ცხავ" ;; -
    ;; "ცხარ" ;; ხ
    ;; "ცხელ" ;; ხ
    ;; "ცხოველ" ;; ხ
    ;; "ცხოვრ" ;; ხ
    ;; "ცხონ" ;; ხ
    ;; "ცხრ1" ;; -
    ;; "ცხრ2" ;; -
    ;; "ცხრილ" ;; ხ
    ;; "ცხუნ" ;; ხ
    ;; "ძახ1" ;; -
    ;; "ძახ2" ;; -
    ;; "ძილფხიზლ" ;; -
    ;; "ძრახ" ;; ხ
    ;; "წახნაგ" ;; ხ
    ;; "წიხვლ" ;; -
    ;; "წმახ" ;; -
    ;; "წმახნ" ;; -
    ;; "წნეხ" ;; ხ
    ;; "წრახნ" ;; -
    ;; "წუხ" ;; ხ
    ;; "ჭარხლ" ;; -
    ;; "ჭახრაკ" ;; -
    ;; "ჭახუნ" ;; -
    ;; "ჭახჭახ1" ;; -
    ;; "ჭახჭახ2" ;; -
    ;; "ჭეხ1" ;; -
    ;; "ჭირხვლ" ;; -
    ;; "ჭირხნ" ;; -
    ;; "ჭიხვინ" ;; -
    ;; "ჭიხჭიხ" ;; -
    ;; "ჭმახ" ;; -
    ;; "ჭმუხ" ;; ხ
    ;; "ჭმუხნ" ;; -
    ;; "ჭუხ" ;; ხ
    ;; "ხ1" ;; -
    ;; "ხაბაზ" ;; ხ
    ;; "ხად1" ;; -
    ;; "ხადილ" ;; ხ
    ;; "ხავერდ" ;; -
    ;; "ხავილ" ;; -
    ;; "ხავს" ;; ხ
    ;; "ხავხავ" ;; -
    ;; "ხაზ" ;; ხ
    ;; "ხაზმუზიან" ;; -
    ;; "ხათრ" ;; -
    ;; "ხაიათ" ;; -
    ;; "ხალ1" ;; -
    ;; "ხალას" ;; -
    ;; "ხალვათ" ;; -
    ;; "ხალის" ;; -
    ;; "ხალისიან" ;; -
    ;; "ხალხურ" ;; -
    ;; "ხამ1" ;; -
    ;; "ხამ2" ;; -
    ;; "ხამ3" ;; -
    ;; "ხამ4" ;; -
    ;; "ხამუშ" ;; -
    ;; "ხამხამ" ;; -
    ;; "ხან1" ;; -
    ;; "ხანგრძლივ" ;; -
    ;; "ხანიერ" ;; -
    ;; "ხანხალ" ;; -
    ;; "ხანხვლ" ;; -
    ;; "ხანჯვლ" ;; -
    ;; "ხაპ" ;; ხ
    ;; "ხარ1" ;; -
    ;; "ხარაზ" ;; ხ
    ;; "ხარატ" ;; -
    ;; "ხარბ" ;; ხ
    ;; "ხარისხ" ;; ხ
    ;; "ხარიხ" ;; -
    ;; "ხარკ" ;; ხ
    ;; "ხარშ" ;; -
    ;; "ხარშოვ" ;; -
    ;; "ხარხარ" ;; -
    ;; "ხარჯ" ;; -
    ;; "ხას" ;; ხ
    ;; "ხასიათ" ;; -
    ;; "ხასხას" ;; -
    ;; "ხატ" ;; ხ
    ;; "ხაფრ" ;; -
    ;; "ხაფხაფ" ;; -
    ;; "ხაშმ" ;; ხ
    ;; "ხაშხაშ" ;; -
    ;; "ხაჭო" ;; ხ
    ;; "ხახუნ" ;; -
    ;; "ხდ1" ;; -
    ;; "ხდ2" ;; -
    ;; "ხდენ1" ;; -
    ;; "ხდენ2" ;; -
    "ხდილ" ;; + ჴდილ ;; ხ,ჴ
    ;; "ხედ"  ;; ჴედ ;; ხ,ჴ
    "ხედნ" ;; ჴედნ ;; ჴ
    ;; "ხევ1" ;; -
    ;; "ხევ2" ;; -
    ;; "ხევ3" ;; -
    "ხევისბერ" ;; ჴევისბერ ;; ჴ
    ;; "ხეთქ" ;; ხ
    ;; "ხეიბრ" ;; -
    ;; "ხეირ" ;; -
    ;; "ხელ1" ;; -
    ;; "ხელ2" ;; -
    ;; "ხელ3" ;; -
    ;; "ხელა" ;; ჴელა ;; ხ,ჴ
    ;; "ხელთ1" ;; -
    ;; "ხელმანკ" ;; -
    ;; "ხელმრუდე" ;; -
    ;; "ხელმძღვანელ" ;; -
    "ხელმწიფ" ;; ჴელმწიფ ;; ჴ
    "ხელოვნ"  ;; + ჴელოვნ ;; ხ,ჴ
    "ხელოსნ"  ;; ჴელოსნ ;; ჴ
    ;; "ხელსაქმ" ;; -
    ;; "ხემს" ;; -
    ;; "ხერგ" ;; -
    ;; "ხერხ1" ;; -
    ;; "ხერხ2" ;; -
    ;; "ხერხიან" ;; -
    ;; "ხეტ1" ;; -
    ;; "ხეტიალ" ;; -
    ;; "ხეჩ" ;; -
    ;; "ხეხ" ;; ხ
    ;; "ხვავ" ;; -
    ;; "ხვალი" ;; ხ
    ;; "ხვედრ" ;; -
    ;; "ხვევ" ;; -
    ;; "ხველ" ;; ხ
    ;; "ხვეტ" ;; -
    ;; "ხვეწ1" ;; -
    ;; "ხვეწ2" ;; -
    ;; "ხვეწნ" ;; -
    ;; "ხვეჭ" ;; -
    ;; "ხვივილ" ;; -
    ;; "ხვილიფ" ;; -
    ;; "ხვიხვინ" ;; -
    ;; "ხვლანჯ" ;; -
    ;; "ხვლეპ" ;; -
    ;; "ხვნეშ" ;; -
    ;; "ხვრემ" ;; -
    ;; "ხვრეპ" ;; -
    ;; "ხვრეტ1" ;; -
    ;; "ხვრეტ2" ;; -
    ;; "ხვრინ" ;; -
    ;; "ხიახ" ;; -
    ;; "ხიბვლ" ;; -
    "ხიდ"  ;; ჴიდ ;; ჴ
    "ხივილ" ;; ჴივილ ;; ხ,ჴ
    ;; "ხიზ" ;; ხ
    ;; "ხიზნ" ;; ხ
    ;; "ხითხით" ;; -
    ;; "ხილ2" ;; -
    ;; "ხილ3" ;; -
    ;; "ხიმან" ;; -
    ;; "ხინძ" ;; -
    ;; "ხინწ" ;; -
    ;; "ხირ" ;; ხ
    ;; "ხიწნ" ;; -
    ;; "ხიხინ" ;; -
    ;; "ხლ1" ;; -
    ;; "ხლ2" ;; -
    ;; "ხლ3" ;; -
    ;; "ხლაკნ" ;; -
    ;; "ხლანძ" ;; -
    ;; "ხლართ" ;; -
    ;; "ხლაფორთ" ;; -
    ;; "ხლახნ2" ;; -
    ;; "ხლეჩ" ;; -
    ;; "ხლეწ" ;; -
    ;; "ხლურჩუნ" ;; -
    ;; "ხმ1" ;; -
    ;; "ხმ2" ;; -
    "ხმარ" ;; ჴმარ ;; ჴ
    "ხმატკბილ" ;; ჴმატკბილ ;; ჴ
    ;; "ხმაურ" ;; -
    "ხმევ" ;; ჴმევ ;; ჴ
    "ხმიან" ;; ჴმიან ;; ჴ
    ;; "ხმობილ" ;; -
    "ხმოვან" ;; ჴმოვან ;; ჴ
    ;; "ხმუჭ" ;; -
    "ხნ"  ;; + ჴნ ;; ხ,ჴ
    ;; "ხნიან" ;; -
    ;; "ხოკ" ;; -
    ;; "ხორავ" ;; -
    ;; "ხორბლ" ;; -
    ;; "ხორგ" ;; -
    ;; "ხორკლიან" ;; -
    "ხორც" ;; ჴორც ;; ჴ
    "ხორციელ" ;; ჴორციელ ;; ჴ
    ;; "ხორხოც" ;; -
    ;; "ხოტონიკ" ;; -
    ;; "ხოტრ" ;; -
    ;; "ხოშკაკლ" ;; -
    "ხოც" ;; ჴოც ;; ჴ
    ;; "ხოხ" ;; ჴოჴ ;; ხ,ჴ
    ;; "ხოხბ" ;; -
    ;; "ხოხინ" ;; -
    ;; "ხოხმიკ" ;; -
    ;; "ხოხნ" ;; -
    ;; "ხოხოლავ" ;; -
    ;; "ხრ1" ;; -
    ;; "ხრ2" ;; -
    ;; "ხრაგუნ" ;; -
    ;; "ხრაკ" ;; -
    ;; "ხრამ" ;; ხ
    ;; "ხრამუნ" ;; -
    ;; "ხრანტალ" ;; -
    ;; "ხრანწ" ;; -
    ;; "ხრაშუნ" ;; -
    ;; "ხრახნ" ;; -
    ;; "ხრეკ" ;; ხ
    ;; "ხრიალ" ;; -
    ;; "ხრიგინ" ;; -
    ;; "ხრინწ" ;; -
    ;; "ხრინწიან" ;; -
    ;; "ხრიოკ" ;; -
    ;; "ხრიწინ" ;; -
    ;; "ხროვ" ;; -
    ;; "ხროტინ" ;; -
    ;; "ხრუკ" ;; -
    ;; "ხრუსტ" ;; -
    ;; "ხრუტუნ" ;; -
    ;; "ხრუშ" ;; -
    ;; "ხრჩვ" ;; -
    "ხრჩოლ" ;; ჴრჩოლ ;; ჴ
    ;; "ხრწენ" ;; -
    ;; "ხსენ1" ;; -
    "ხსნ" ;; ჴსნ ;; ჴ
    "ხსნილ" ;; ჴსნილ ;; ჴ
    "ხსოვნ" ;; ჴსოვნ ;; ჴ
    ;; "ხტომ" ;; -
    ;; "ხტუნავ" ;; -
    ;; "ხუ1" ;; -
    "ხუთ" ;; ? ჴუთ ;; ხ,ჴ
    ;; "ხუთრ" ;; -
    ;; "ხუილ" ;; -
    ;; "ხუმრ" ;; ხ
    ;; "ხუნ" ;; ჴუნ ;; ხ,ჴ
    ;; "ხუნტრუც" ;; -
    ;; "ხუნძლ" ;; -
    ;; "ხურ1" ;; -
    ;; "ხურ2" ;; -
    ;; "ხურდავ" ;; -
    ;; "ხურო" ;; ხ
    ;; "ხუროთმოძღვრ" ;; -
    ;; "ხურხვლ" ;; -
    ;; "ხუსხუს" ;; -
    ;; "ხუტ" ;; ხ
    ;; "ხუფ" ;; -
    ;; "ხუჩხუჩ" ;; -
    ;; "ხუც" ;; ხ
    ;; "ხუჭ1" ;; -
    ;; "ხუჭუჭ" ;; -
    ;; "ხუხ" ;; -
    ;; "ხუხულავ" ;; -
    "ხშვ" ;; ჴშვ ;; ჴ
    "ხშირ" ;; ჴშირ ;; ჴ
    ;; "ჯახ" ;; -
    ;; "ჯახირ" ;; -
    ;; "ჯახუნ" ;; -
    ;; "ჯლეხ" ;; -
    ;; "ჯოხ" ;; ხ
    ))

(defparameter *q-root-list*
  (u:collecting
    (dolist (x-root *x-root-list*)
      (u:collect (substitute #\ჴ #\ხ x-root)))))


(with-transaction ()
  (dolist (x-root *x-root-list*)
    (debug x-root)
    (dolist (root+uid (select [root] [unique-id]
			      :from [morph verb-features]
			      :where [= [c-root] ?x-root]))
      (destructuring-bind (root uid) root+uid
	(update-records [morph verb-features]
			:av-pairs `(([root] ,(substitute #\ჴ #\ხ root)))
			:where [= [unique-id] ?uid])))))
    

#||
(pprint (select [root] [c-root] :distinct t :from [morph verb-features]
		:where [= [c-root] "შენ1"]))

(update-records [morph verb-features]
		:av-pairs '(([root] "შჱნ"))
		:where [= [c-root] "შენ1"])

||#

#+test
(clrhash *feature-cache*)	


;; კრ/კარ -> კAრ

(defparameter *strong-aor*
  (select [id] [sub-id] ;; [root] [c-root]
	  :from [morph verb-features]
	  :distinct t
	  :where [and [= [morph-type] "active"]
		      [= [type-aorist] "strong"]]
	  :order-by '([id] [sub-id])))

(dolist (id+sub-id *strong-aor*)
  (destructuring-bind (id sub-id) id+sub-id
    (print (select [root]
		   :from [morph verb-features]
		   :distinct t :flatp t
		   :where [and [= [id] ?id]
			       [= [sub-id] ?sub-id]]))))

(defun sync-root (roots)
  (let ((roots (sort roots #'< :key #'length)))
    (cond ((string= (car roots) (delete #\ე (cadr roots)))	
	   (substitute #\E #\ე (cadr roots)))
	  ((string= (car roots) (delete #\ა (cadr roots)))
	   (substitute #\A #\ა (cadr roots))))))

(print (sync-root '("გენ" "გნ")))

(defun fix-strong-aor (id sub-id)
  (let* ((rows (select [*]
		       :from [morph verb-features]
		       :where [and [= [id] ?id]
				   [= [sub-id] ?sub-id]
				   [or [like [tense] "%|aorist|%"]
				       [like [tense] "%|optative|%"]
				       [like [tense] "%|pluperfect|%"]
				       [like [tense] "%|conj-perfect|%"]]]))
	 (new-row (mapcar #'list (car rows))))
    (dolist (row (cdr rows))
      (loop for val in row
	 for rest on new-row
	 do (pushnew val (car rest) :test #'equal)))
    (destructuring-bind (root c-root tense pv vn gv sf caus-sf vv tsch-class morph-type relation
			      reduplication red-dir-pv stem-type pr-st-ext part-pfx part-sfx passive-sfx
			      type-aorist type-obj-3-pfx type-aorist-3sg type-optative
			      nasal-infix subj-pers subj-num obj-pers type-subj12-sfx
			      type-subj3-sfx type-subj2-pfx type-ev-sfx
			      style type-pr-st-ext paradigm-replacement
			      source comment derived-type author date deleted) (cdddr new-row)
      (when (and (null (cdr pv))
		 (cdr root) (null (cddr root)))
	#+ignore
	(print (cdr new-row))
	(print (list id sub-id c-root root pv subj-pers))
	(let ((sync-root (sync-root root)))
	  (when (debug sync-root)
	    #+orig
	    (update-records [morph verb-features]
			    :av-pairs `(([root] ,sync-root))
			    :where [and [= [id] ?id]
				   [= [sub-id] ?sub-id]
				   [or [like [tense] "%|aorist|%"]
				       [like [tense] "%|optative|%"]
				       [like [tense] "%|pluperfect|%"]
				       [like [tense] "%|conj-perfect|%"]]])))
	))))

(dolist (id+sub-id *strong-aor*)
  (destructuring-bind (id sub-id) id+sub-id
    (fix-strong-aor id sub-id)))

(fix-strong-aor 1033 1)


(print (select [root] [c-root]
	       :from [morph verb-features]
	       :where [= [root] "ხრწნ"]))

(defun replace-root (&key old new c-root)
  (update-records [morph verb-features]
		  :av-pairs `(([root] ,new))
		  :where [and [= [c-root] ?c-root]
			      [= [root] ?old]]))

(replace-root :old "ხრწნ" :new "ჴრწნ" :c-root "ხრწნ")


;; ყოფა-compounds

(with-file-lines (line "projects:georgian-morph;wordlists;oge-deu-words1.txt")
  (when (search "-ყოფა" line)
    (format t "{~a} | " (subseq line 0 (position #\- line :from-end t)))))


:eof